### 🌊 Neptune Plan Results

**Terraform Stacks:** `apps/web, apps/web/ci-102-1, apps/web/ci-102-2`

**Neptune completed the plan with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23396170626)

**Command ✅** `terragrunt init -upgrade` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 05:07:05.678 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web] 05:07:06.024 STDOUT tofu: Initializing the backend...
05:07:06.340 STDOUT tofu: 
05:07:06.340 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:07:06.340 STDOUT tofu: use this backend unless the backend configuration changes.
05:07:06.468 STDOUT tofu: Initializing provider plugins...
05:07:06.468 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:07:06.615 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:07:06.981 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:07:07.338 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:07:07.859 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:07:08.258 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:07:08.258 STDOUT tofu: Providers are signed by their developers.
05:07:08.258 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:07:08.258 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:07:08.258 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:07:08.258 STDOUT tofu: selections it made above. Include this file in your version control repository
05:07:08.258 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:07:08.258 STDOUT tofu: you run "tofu init" in the future.
05:07:08.258 STDOUT tofu: OpenTofu has been successfully initialized!
05:07:08.258 STDOUT tofu: 
05:07:08.258 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:07:08.258 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:07:08.259 STDOUT tofu: should now work.
05:07:08.259 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:07:08.259 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:07:08.259 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-1] 05:07:08.564 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/LjDMVE2jnA-r4KEPw1_3gHdJxtE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-102-1] 05:07:08.836 STDOUT tofu: Initializing the backend...
05:07:09.188 STDOUT tofu: 
05:07:09.188 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:07:09.188 STDOUT tofu: use this backend unless the backend configuration changes.
05:07:09.361 STDOUT tofu: Initializing provider plugins...
05:07:09.361 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:07:09.440 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:07:09.675 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:07:10.010 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:07:10.223 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:07:10.587 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:07:10.587 STDOUT tofu: Providers are signed by their developers.
05:07:10.587 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:07:10.587 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:07:10.587 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:07:10.587 STDOUT tofu: selections it made above. Include this file in your version control repository
05:07:10.587 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:07:10.587 STDOUT tofu: you run "tofu init" in the future.
05:07:10.587 STDOUT tofu: OpenTofu has been successfully initialized!
05:07:10.587 STDOUT tofu: 
05:07:10.587 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:07:10.587 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:07:10.587 STDOUT tofu: should now work.
05:07:10.587 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:07:10.588 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:07:10.588 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-2] 05:07:10.893 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/Yc3gcfg0bxbyefOz0IsZf6F6epE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-102-2] 05:07:11.180 STDOUT tofu: Initializing the backend...
05:07:11.496 STDOUT tofu: 
05:07:11.496 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:07:11.497 STDOUT tofu: use this backend unless the backend configuration changes.
05:07:11.666 STDOUT tofu: Initializing provider plugins...
05:07:11.666 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:07:11.769 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:07:12.163 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:07:12.510 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:07:12.741 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:07:13.097 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:07:13.097 STDOUT tofu: Providers are signed by their developers.
05:07:13.097 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:07:13.097 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:07:13.097 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:07:13.097 STDOUT tofu: selections it made above. Include this file in your version control repository
05:07:13.097 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:07:13.097 STDOUT tofu: you run "tofu init" in the future.
05:07:13.097 STDOUT tofu: OpenTofu has been successfully initialized!
05:07:13.097 STDOUT tofu: 
05:07:13.098 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:07:13.098 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:07:13.098 STDOUT tofu: should now work.
05:07:13.098 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:07:13.098 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:07:13.098 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web] 05:07:14.458 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:07:14.459 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
05:07:14.468 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:07:14.468 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:07:14.468 STDOUT tofu:   + create
05:07:14.468 STDOUT tofu: OpenTofu will perform the following actions:
05:07:14.468 STDOUT tofu:   # local_file.output will be created
05:07:14.468 STDOUT tofu:   + resource "local_file" "output" {
05:07:14.468 STDOUT tofu:       + content              = "apps/web deployed"
05:07:14.468 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:07:14.468 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:07:14.468 STDOUT tofu:       + content_md5          = (known after apply)
05:07:14.469 STDOUT tofu:       + content_sha1         = (known after apply)
05:07:14.469 STDOUT tofu:       + content_sha256       = (known after apply)
05:07:14.469 STDOUT tofu:       + content_sha512       = (known after apply)
05:07:14.469 STDOUT tofu:       + directory_permission = "0777"
05:07:14.469 STDOUT tofu:       + file_permission      = "0777"
05:07:14.469 STDOUT tofu:       + filename             = "./output.txt"
05:07:14.469 STDOUT tofu:       + id                   = (known after apply)
05:07:14.469 STDOUT tofu:     }
05:07:14.469 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:07:14.469 STDOUT tofu: 
05:07:14.469 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:07:14.469 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:07:14.469 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-102-1] 05:07:15.812 STDOUT tofu: null_resource.stack: Refreshing state... [id=513367671554999496]
05:07:15.813 STDOUT tofu: local_file.output: Refreshing state... [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:07:15.822 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:07:15.822 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:07:15.822 STDOUT tofu:   + create
05:07:15.822 STDOUT tofu: OpenTofu will perform the following actions:
05:07:15.822 STDOUT tofu:   # local_file.output will be created
05:07:15.822 STDOUT tofu:   + resource "local_file" "output" {
05:07:15.822 STDOUT tofu:       + content              = "apps/web/ci-102-1 deployed"
05:07:15.822 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:07:15.822 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:07:15.822 STDOUT tofu:       + content_md5          = (known after apply)
05:07:15.822 STDOUT tofu:       + content_sha1         = (known after apply)
05:07:15.822 STDOUT tofu:       + content_sha256       = (known after apply)
05:07:15.822 STDOUT tofu:       + content_sha512       = (known after apply)
05:07:15.823 STDOUT tofu:       + directory_permission = "0777"
05:07:15.823 STDOUT tofu:       + file_permission      = "0777"
05:07:15.823 STDOUT tofu:       + filename             = "./output.txt"
05:07:15.823 STDOUT tofu:       + id                   = (known after apply)
05:07:15.823 STDOUT tofu:     }
05:07:15.823 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:07:15.823 STDOUT tofu: 
05:07:15.823 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:07:15.823 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:07:15.823 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-102-2] 05:07:17.179 STDOUT tofu: null_resource.stack: Refreshing state... [id=2217601692384182174]
05:07:17.179 STDOUT tofu: local_file.output: Refreshing state... [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:07:17.189 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:07:17.189 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:07:17.189 STDOUT tofu:   + create
05:07:17.189 STDOUT tofu: OpenTofu will perform the following actions:
05:07:17.190 STDOUT tofu:   # local_file.output will be created
05:07:17.190 STDOUT tofu:   + resource "local_file" "output" {
05:07:17.190 STDOUT tofu:       + content              = "apps/web/ci-102-2 deployed"
05:07:17.190 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:07:17.190 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:07:17.190 STDOUT tofu:       + content_md5          = (known after apply)
05:07:17.190 STDOUT tofu:       + content_sha1         = (known after apply)
05:07:17.190 STDOUT tofu:       + content_sha256       = (known after apply)
05:07:17.190 STDOUT tofu:       + content_sha512       = (known after apply)
05:07:17.190 STDOUT tofu:       + directory_permission = "0777"
05:07:17.190 STDOUT tofu:       + file_permission      = "0777"
05:07:17.190 STDOUT tofu:       + filename             = "./output.txt"
05:07:17.190 STDOUT tofu:       + id                   = (known after apply)
05:07:17.191 STDOUT tofu:     }
05:07:17.191 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:07:17.191 STDOUT tofu: 
05:07:17.191 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:07:17.191 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:07:17.191 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>


To apply these changes, comment:
```
@neptbot apply
```
